## Production: data_import
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 12 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                  NAME                                  |
|--------|------------------------------------------------------------------------|
| add    | `aws_security_group.cra_upd_ecs_data_import_sg`                        |
|        | `module.data_import_ecs.aws_cloudwatch_log_group.this`                 |
|        | `module.data_import_ecs.aws_ecs_cluster.this[0]`                       |
|        | `module.data_import_ecs.aws_ecs_cluster_capacity_providers.this[0]`    |
|        | `module.data_import_ecs.aws_ecs_service.this`                          |
|        | `module.data_import_ecs.aws_ecs_task_definition.this`                  |
|        | `module.data_import_ecs.aws_iam_policy.this_task[0]`                   |
|        | `module.data_import_ecs.aws_iam_policy.this_task_exec`                 |
|        | `module.data_import_ecs.aws_iam_role.this_task`                        |
|        | `module.data_import_ecs.aws_iam_role.this_task_exec`                   |
|        | `module.data_import_ecs.aws_iam_role_policy_attachment.this_task[0]`   |
|        | `module.data_import_ecs.aws_iam_role_policy_attachment.this_task_exec` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_security_group.cra_upd_ecs_data_import_sg will be created
  + resource "aws_security_group" "cra_upd_ecs_data_import_sg" {
      + arn                    = (known after apply)
      + description            = "ECS Security Group for CRA UPD data import"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "cra-upd-ecs-data-import-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "production"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.data_import_ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + inference_accelerator    = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "cra-upd-dashboard-data-import-service"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.data_import_ecs.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecr:GetDownloadUrlForLayer",
                              + "ecr:GetAuthorizationToken",
                              + "ecr:BatchGetImage",
                              + "ecr:BatchCheckLayerAvailability",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action = [
                              + "ssm:GetParametersByPath",
                              + "ssm:GetParameters",
                              + "ssm:GetParameter",
                            ]
                          + Effect = "Allow"
                          + Sid    = "AllowSSMParameterAccess"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
        ]
    }

  # module.data_import_ecs.data.aws_iam_policy_document.this_task_exec_logs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:DescribeLogGroups",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.data_import_ecs.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/cra-upd-dashboard-data-import-cluster/cra-upd-dashboard-data-import-service"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "CraUpdDashboard"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "production"
          + "Terraform"   = "true"
        }
    }

  # module.data_import_ecs.aws_ecs_cluster.this[0] will be created
  + resource "aws_ecs_cluster" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "cra-upd-dashboard-data-import-cluster"
      + tags     = {
          + "CostCentre" = "CraUpdDashboard"
          + "Terraform"  = "true"
        }
      + tags_all = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "production"
          + "Terraform"   = "true"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.data_import_ecs.aws_ecs_cluster_capacity_providers.this[0] will be created
  + resource "aws_ecs_cluster_capacity_providers" "this" {
      + capacity_providers = [
          + "FARGATE",
        ]
      + cluster_name       = "cra-upd-dashboard-data-import-cluster"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE"
          + weight            = 1
        }
    }

  # module.data_import_ecs.aws_ecs_service.this will be created
  + resource "aws_ecs_service" "this" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "cra-upd-dashboard-data-import-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 0
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "cra-upd-dashboard-data-import-service"
      + platform_version                   = "LATEST"
      + propagate_tags                     = "SERVICE"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCentre" = "CraUpdDashboard"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "production"
          + "Terraform"   = "true"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_controller {
          + type = "ECS"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + null,
            ]
        }
    }

  # module.data_import_ecs.aws_ecs_task_definition.this will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "4096"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "cra-upd-dashboard-data-import-service"
      + id                       = (known after apply)
      + memory                   = "8192"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCentre" = "CraUpdDashboard"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "production"
          + "Terraform"   = "true"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # module.data_import_ecs.aws_iam_policy.this_task[0] will be created
  + resource "aws_iam_policy" "this_task" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "cra-upd-dashboard-data-import-service_ecs_task_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListObjects",
                          + "s3:ListBucket",
                          + "s3:HeadObject",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "/*",
                          + "",
                        ]
                      + Sid      = "AllowDataBucketReadWriteAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "CraUpdDashboard"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "production"
          + "Terraform"   = "true"
        }
    }

  # module.data_import_ecs.aws_iam_policy.this_task_exec will be created
  + resource "aws_iam_policy" "this_task_exec" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "cra-upd-dashboard-data-import-service_ecs_task_exec_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "CraUpdDashboard"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "production"
          + "Terraform"   = "true"
        }
    }

  # module.data_import_ecs.aws_iam_role.this_task will be created
  + resource "aws_iam_role" "this_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cra-upd-dashboard-data-import-service_ecs_task_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "CraUpdDashboard"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "production"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.data_import_ecs.aws_iam_role.this_task_exec will be created
  + resource "aws_iam_role" "this_task_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cra-upd-dashboard-data-import-service_ecs_task_exec_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "CraUpdDashboard"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre"  = "CraUpdDashboard"
          + "Environment" = "production"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.data_import_ecs.aws_iam_role_policy_attachment.this_task[0] will be created
  + resource "aws_iam_role_policy_attachment" "this_task" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "cra-upd-dashboard-data-import-service_ecs_task_role"
    }

  # module.data_import_ecs.aws_iam_role_policy_attachment.this_task_exec will be created
  + resource "aws_iam_role_policy_attachment" "this_task_exec" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "cra-upd-dashboard-data-import-service_ecs_task_exec_role"
    }

Plan: 12 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.cra_upd_ecs_data_import_sg"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
